In [1]:
import pandas as pd
import numpy as np
from ortools.sat.python import cp_model
from datetime import datetime, timedelta

In [2]:
import sys
sys.path.append('/home/cayena/Projeto_thefamily/TeacherScheduler/')

In [3]:
from streamlit_app.utils import transform_classes_dateframe,transform_teacher_dataframe,transform_alocation_dataframe,base_selection,expand_rows,replicate_row,clean_data
from streamlit_app.teacher_alocation import TeacherScheduler
from streamlit_app.validador import validador

2025-03-26 13:03:08.844 WARNING streamlit.runtime.scriptrunner_utils.script_run_context: Thread 'MainThread': missing ScriptRunContext! This warning can be ignored when running in bare mode.
2025-03-26 13:03:08.848 WARNING streamlit.runtime.scriptrunner_utils.script_run_context: Thread 'MainThread': missing ScriptRunContext! This warning can be ignored when running in bare mode.
2025-03-26 13:03:08.851 WARNING streamlit.runtime.scriptrunner_utils.script_run_context: Thread 'MainThread': missing ScriptRunContext! This warning can be ignored when running in bare mode.
2025-03-26 13:03:08.854 WARNING streamlit.runtime.scriptrunner_utils.script_run_context: Thread 'MainThread': missing ScriptRunContext! This warning can be ignored when running in bare mode.

In [4]:
aulas_raw = pd.read_excel('/home/cayena/Downloads/TESTE ROTA 07.03(2).xlsx')

professores_raw = pd.read_excel('/home/cayena/Downloads/TESTE TEACHERS 07.03(2).xlsx')

/home/cayena/.local/lib/python3.10/site-packages/openpyxl/worksheet/_reader.py:329: UserWarning: Data Validation extension is not supported and will be removed
  warn(msg)

In [5]:
df_result =transform_classes_dateframe(aulas_raw)
df_professor = transform_teacher_dataframe(professores_raw)

In [6]:
Ts = TeacherScheduler(df_result, df_professor)
base_alocada = Ts.schedule_teachers()
base_alocada

36

    professores_alocados             nome grupo
0                  ALINE     ABU DHABI EAD - 4X
1                DARLENE  ANDERSON VIP EAD - 1X
2                BARBARA        AUCKLAND P - 4X
3         BRUNO MORGILLO     BAKERSFIELD P - 4X
4         BRUNO MORGILLO        BERMUDAS P - 4X
..                   ...                    ...
137              LORRANY     NORTHAMPTOM P - 3X
138                 CAIO    PHILADELPHIA P - 3X
139              NATACHA      SAN JUAN EAD - 3X
140              MATTHEW         SCOTT EAD - 3X
141              RAPHAEL     SOUTHAMPTON P - 3X

[142 rows x 2 columns]

In [7]:
validador(df_result,df_professor).check_impossible_time()

In [10]:
df_final,aulas_nao_alocadas = transform_alocation_dataframe(aulas_raw,base_alocada)
aulas_nao_alocadas

Empty DataFrame
Columns: [nome grupo, horario, unidade, dias da semana, stage, livro, modalidade, grupo, n aulas, parag atual grupo, parag_final_grupo, teacher, status, zoom, n_alunos, rescisao, permuta, bolsista, n_total_alunos, stage_formula, parag_final_formula, num_1_sempre, ultimo_professor, penultimo_professor, restricoes_professor]
Index: []

[0 rows x 25 columns]

In [11]:
numero_aulas = df_final.groupby('teacher').agg({'n aulas':'sum'}).sort_values('n aulas',ascending=False).reset_index()
numero_aulas = pd.merge(numero_aulas,df_professor[['TEACHER','MEDIA']],left_on='teacher',right_on='TEACHER',how='left')

In [12]:
numero_aulas

            teacher  n aulas          TEACHER  MEDIA
0            LEONEL       27           LEONEL     24
1             MARIA       27            MARIA     24
2            FELIPE       23           FELIPE     20
3           MADISON       19          MADISON     16
4             LYENE       19            LYENE     16
5           LORRANY       19          LORRANY     16
6           CLAUDIO       18          CLAUDIO     20
7           DARLENE       16          DARLENE     16
8          GIOVANNA       15         GIOVANNA     12
9           LUCIANO       15          LUCIANO     12
10          LUCIANA       15          LUCIANA     12
11          MATTHEW       15          MATTHEW     12
12          RAPHAEL       15          RAPHAEL     12
13             CAIO       15             CAIO     12
14            TELMA       15            TELMA     12
15           CENKAY       15           CENKAY     12
16   BRUNO MORGILLO       14   BRUNO MORGILLO     24
17          JULIANA       11          JULIANA     12
18          NATACHA       11          NATACHA      8
19             RYAN       11             RYAN      8
20            CAROL       11            CAROL      8
21           SAMARA       11           SAMARA      8
22  WANDERSON - ESP       10  WANDERSON - ESP      8
23          RODRIGO        9          RODRIGO      8
24  LARISSA ANDRADE        7  LARISSA ANDRADE      8
25             NICK        6             NICK      8
26           CARLOS        5           CARLOS     13
27          BARBARA        4          BARBARA     16
28            ALINE        4            ALINE      4
29      DIEGO - ESP        3      DIEGO - ESP      4
30            BELLA        3            BELLA     24
31         FERNANDO        1         FERNANDO     24